Autodesk.Revit.DB.Viewport.GetProjectionToSheetTransform
Returns the transform from the view's projection space to the sheet space.
Remarks:
This transform accounts for the position and rotation of a
viewport on a sheet.
Returns:
The transform from the view's projection space to the sheet space.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The viewport is not on a sheet.
-or-
The viewport does not have transforms.
Since:
2019.2

Autodesk.Revit.DB.Viewport.HasViewportTransforms
Indicates if the viewport has transforms.
Remarks:
Not all viewports have transforms.  For example,
viewports for schedules and legends do not have transforms.
Returns:
True if the viewport has transforms, false otherwise.
Since:
2019.2

Autodesk.Revit.DB.Viewport.GetLabelOutline
Gets the outline viewport's label on the sheet.
Returns:
The outline of the viewport's label on the sheet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The viewport is not on a sheet.
Since:
2013

Autodesk.Revit.DB.Viewport.SetBoxCenter(Autodesk.Revit.DB.XYZ)
Moves this viewport so that the center of the box outline (excluding the viewport label) is at a given point.
newCenterPoint:
The desired center for the box outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The viewport is not on a sheet.
Since:
2014

Autodesk.Revit.DB.Viewport.GetBoxCenter
Returns the center of the outline of the viewport on the sheet, excluding the viewport label.
Returns:
The center of the outline of the viewport on the sheet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The viewport is not on a sheet.
Since:
2014

Autodesk.Revit.DB.Viewport.GetBoxOutline
Returns the outline of the viewport on the sheet, excluding the viewport label.
Returns:
The outline of the viewport on the sheet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The viewport is not on a sheet.
Since:
2013

Autodesk.Revit.DB.Viewport.CanAddViewToSheet(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Verifies that the view can be added to the ViewSheet.
Remarks:
Schedule views are not handled by the Viewport class.  Refer to ScheduleInstance for information about adding schedules to sheets.
document:
The document in which the views reside.
viewSheetId:
The ViewSheet on which the view will be placed.
viewId:
The view which will be checked to see if it can be placed on the sheet.
Returns:
True if the view can be added to the ViewSheet, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Viewport.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Creates a new Viewport at a given location on a sheet.
Remarks:
Use ScheduleInstance.Create() to add schedules to sheets.
document:
The document to which the new Viewport will be added.
viewSheetId:
The ViewSheet on which the new Viewport will be placed.
viewId:
The view shown in the Viewport.
point:
The new Viewport will be centered on this point.
Returns:
The new Viewport.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewSheetId is not a ViewSheet.
-or-
viewId cannot be added to the ViewSheet.
-or-
Plan view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.Viewport.Rotation
The rotation of the viewport on the sheet.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Viewport.SheetId
The element id of the ViewSheet on which the viewport appears,
or InvalidElementId if this viewport does not associate a view
with placement onto a sheet.
Since:
2013

Autodesk.Revit.DB.Viewport.ViewId
The element id of the associated View.
Since:
2013

Autodesk.Revit.DB.Viewport
An element that establishes the placement of a view on a sheet.
Remarks:
Viewports are used in Revit for purposes other than placement of
views on sheets. Thus iteration of viewport elements in the model may
locate viewports which are not assigned to sheets; you can use the
SheetId property to filter these out.
Since:
2013